<%-- 
    Document   : 2
    Created on : 2018/02/01, 16:12:01
    Author     : takahashi
--%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>JSP Page</title>
    </head>
    <%/*
    
『抽象化』
 <役目>      <情報>                     <動作>
・食物        味、色、大きさ              育つ、腐る～～食べられる、調理される
・本          文字、外観、紙質、言語      風化する～～読まれる、触られる
・雪          白い、冷たい               積もる、降る、溶ける～～雪かきされる 
・衣服        素材、色合い、肌触り      　色落ちする、破れる～～着られる、補修される、畳まれる
・人          外見、国籍、年齢、性別      歩く、立つ、考える、話す、歳をとる


『クラスとインスタンス』
**人クラス**
(名称 //肌色 //体形 //礼儀・人当たり )

人インスタンス
(N //白い //細い //やや無礼 )

人インスタンス
(Y //黒い //やや太い //少し無礼 )

人インスタンス
(Y //やや黒い //標準 //普通 )

人インスタンス
(D //黄色い //だいぶ太い //無礼 )

    */%>